
  #### Terraform Initialization ⚙️`success`

  #### Terraform Format and Style 🖌`success`

  #### Terraform Validation 🤖`success`
  <details><summary>Validation Output</summary>

  ```

  Success! The configuration is valid.


  ```

  </details>

  #### Terraform Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```

  terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "northcentralus"
      + name     = "ci-cd-demo-azure-rg"
    }

  # module.todo_app.module.todo_service.azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "todo-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "ci-cd-demo-azure-rg"
      + revision_mode                 = "Single"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = true
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "http2"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = (known after apply)
          + server   = (known after apply)
        }

      + template {
          + max_replicas                     = 10
          + min_replicas                     = 0
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = (known after apply)
              + memory            = "0.5Gi"
              + name              = "todo-service"

              + env {
                  + name  = "SERVER_HOST"
                  + value = "0.0.0.0"
                }
              + env {
                  + name  = "SERVER_PORT"
                  + value = "8080"
                }
              + env {
                  + name  = "DB_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "DB_PORT"
                  + value = "5432"
                }
              + env {
                  + name  = "DB_NAME"
                  + value = "todo_db"
                }
              + env {
                  + name  = "DB_USER"
                  + value = "todo_service_user"
                }
              + env {
                  + name  = "DB_PASSWORD"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "DB_SSL_ENABLED"
                  + value = "true"
                }
            }
        }
    }

  # module.todo_app.module.todo_service.azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "northcentralus"
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "todo-service"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "ci-cd-demo-azure-rg"
      + static_ip_address                = (known after apply)
      + zone_redundancy_enabled          = false
    }

  # module.todo_app.module.todo_service_prereqs.module.todo_service_container_registry.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "northcentralus"
      + login_server                  = (known after apply)
      + name                          = "lmtorresv"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "ci-cd-demo-azure-rg"
      + sku                           = "Standard"
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.todo_app.module.todo_service_prereqs.module.todo_service_container_registry.azurerm_role_assignment.pull_user will be created
  + resource "azurerm_role_assignment" "pull_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "acrpull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.todo_app.module.todo_service_prereqs.module.todo_service_container_registry.azurerm_user_assigned_identity.pull_user will be created
  + resource "azurerm_user_assigned_identity" "pull_user" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northcentralus"
      + name                = "lmtorresv-pull-user"
      + principal_id        = (known after apply)
      + resource_group_name = "ci-cd-demo-azure-rg"
      + tenant_id           = (known after apply)
    }

  # module.todo_app.module.todo_service_stateful.module.todo_service_db.azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = "todo_service_user"
      + administrator_password        = (sensitive value)
      + administrator_password_wo     = (write-only attribute)
      + auto_grow_enabled             = false
      + backup_retention_days         = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "northcentralus"
      + name                          = "lmtorresv"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "ci-cd-demo-azure-rg"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "17"

      + authentication (known after apply)
    }

  # module.todo_app.module.todo_service_stateful.module.todo_service_db.azurerm_postgresql_flexible_server_database.this will be created
  + resource "azurerm_postgresql_flexible_server_database" "this" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "todo_db"
      + server_id = (known after apply)
    }

  # module.todo_app.module.todo_service_stateful.module.todo_service_db.azurerm_postgresql_flexible_server_firewall_rule.this will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "this" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "allow-public-access-from-any-azure-service"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + todo_service_host = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

  ```

  </details>
